In [17]:
import pandas as pd
import numpy as np

csv_path = pd.read_csv('../data/cleaned_data.csv')
csv_path.head()

,customer_id,location,gender,signup_date,sale_id,product_id,timestamp,quantity,price,revenue,name,category,supplier,customer_lifetime_value,timestamp_last,days_since_last_purchase
0,1,Ibadan,Male,2020-12-25,164,56,2023-09-08,4,8313,33252,Product_56,Groceries,Supplier A,692985,2023-09-08,114
1,1,Ibadan,Male,2020-12-25,424,28,2022-11-19,4,27160,108640,Product_28,Groceries,Supplier D,692985,2023-09-08,114
2,1,Ibadan,Male,2020-12-25,498,44,2021-11-30,2,24321,48642,Product_44,Books,Supplier B,692985,2023-09-08,114
3,1,Ibadan,Male,2020-12-25,586,41,2021-11-22,4,11883,47532,Product_41,Groceries,Supplier D,692985,2023-09-08,114
4,1,Ibadan,Male,2020-12-25,841,68,2021-10-08,1,14788,14788,Product_68,Electronics,Supplier A,692985,2023-09-08,114

In [18]:
csv_path['name'] = csv_path['name'].str.strip().str.title()
csv_path = csv_path.rename(columns={'name': 'product_name'})

In [19]:
csv_path.dtypes

customer_id                  int64
location                    object
gender                      object
signup_date                 object
sale_id                      int64
product_id                   int64
timestamp                   object
quantity                     int64
price                        int64
revenue                      int64
product_name                object
category                    object
supplier                    object
customer_lifetime_value      int64
timestamp_last              object
days_since_last_purchase     int64
dtype: object

In [20]:
csv_path['revenue'].isna().sum()

np.int64(0)

In [21]:
csv_path["products_total_revenue"] = csv_path.groupby('product_name')['revenue'].transform('sum')

In [22]:
csv_path["supplier_total_revenue"] = csv_path.groupby('supplier')['revenue'].transform('sum')

In [23]:
csv_path["category_total_revenue"] = csv_path.groupby('category')['revenue'].transform('sum')
csv_path.head()

,customer_id,location,gender,signup_date,sale_id,product_id,timestamp,quantity,price,revenue,product_name,category,supplier,customer_lifetime_value,timestamp_last,days_since_last_purchase,products_total_revenue,supplier_total_revenue,category_total_revenue
0,1,Ibadan,Male,2020-12-25,164,56,2023-09-08,4,8313,33252,Product_56,Groceries,Supplier A,692985,2023-09-08,114,1005873,83066177,59987546
1,1,Ibadan,Male,2020-12-25,424,28,2022-11-19,4,27160,108640,Product_28,Groceries,Supplier D,692985,2023-09-08,114,4236960,80265768,59987546
2,1,Ibadan,Male,2020-12-25,498,44,2021-11-30,2,24321,48642,Product_44,Books,Supplier B,692985,2023-09-08,114,2845557,57090443,38913866
3,1,Ibadan,Male,2020-12-25,586,41,2021-11-22,4,11883,47532,Product_41,Groceries,Supplier D,692985,2023-09-08,114,1663620,80265768,59987546
4,1,Ibadan,Male,2020-12-25,841,68,2021-10-08,1,14788,14788,Product_68,Electronics,Supplier A,692985,2023-09-08,114,1878076,83066177,56030257

In [24]:
revenue_generated = csv_path[["products_total_revenue", "supplier_total_revenue", "category_total_revenue"]]
revenue_generated

      products_total_revenue  supplier_total_revenue  category_total_revenue
0                    1005873                83066177                59987546
1                    4236960                80265768                59987546
2                    2845557                57090443                38913866
3                    1663620                80265768                59987546
4                    1878076                83066177                56030257
...                      ...                     ...                     ...
4995                 1472427                83066177                56030257
4996                 1576638                83066177                40566464
4997                 1005873                83066177                59987546
4998                 1282272                80265768                64094568
4999                 4053140                80265768                40979433

[5000 rows x 3 columns]

In [25]:

csv_path['timestamp'] = pd.to_datetime(csv_path['timestamp'])
csv_path['month'] = csv_path['timestamp'].dt.to_period('M')

monthly_trend = csv_path.pivot_table(
    values='revenue',
    index='month',
    aggfunc='sum'
)

In [26]:
monthly_trend

          revenue
month
2021-01   9234338
2021-02   6890176
2021-03   8652073
2021-04   7739719
2021-05   7378699
2021-06   7285877
2021-07   7410526
2021-08   7122355
2021-09   7507610
2021-10   8434824
2021-11  10463756
2021-12   7902854
2022-01   8999634
2022-02   6323158
2022-03   7712722
2022-04   9429732
2022-05   8839270
2022-06   7875536
2022-07   8800702
2022-08   9530878
2022-09   7939963
2022-10   7985781
2022-11   7988755
2022-12   9037050
2023-01   8493678
2023-02   8801556
2023-03   8923624
2023-04   9808223
2023-05  10292948
2023-06   7490917
2023-07   8099269
2023-08   8185756
2023-09   9532311
2023-10   6692554
2023-11   8854512
2023-12   8910798

In [27]:
csv_path.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 20 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               5000 non-null   int64
 1   location                  5000 non-null   object
 2   gender                    5000 non-null   object
 3   signup_date               5000 non-null   object
 4   sale_id                   5000 non-null   int64
 5   product_id                5000 non-null   int64
 6   timestamp                 5000 non-null   datetime64[ns]
 7   quantity                  5000 non-null   int64
 8   price                     5000 non-null   int64
 9   revenue                   5000 non-null   int64
 10  product_name              5000 non-null   object
 11  category                  5000 non-null   object
 12  supplier                  5000 non-null   object
 13  customer_lifetime_value   5000 non-null   int64
 14  timestamp_last            5000 non-null   object
 15  days_since_last_purchase  5000 non-null   int64
 16  products_total_revenue    5000 non-null   int64
 17  supplier_total_revenue    5000 non-null   int64
 18  category_total_revenue    5000 non-null   int64
 19  month                     5000 non-null   period[M]
dtypes: datetime64[ns](1), int64(11), object(7), period[M](1)
memory usage: 781.4+ KB